export const dataType = [
    {
        src: '/src/img/Content/AboutService.png',
        title: 'Інтерактивні уроки',
        description: 'Велика кількість уроків для кожного курсу. Обирайте будь-який доступний урок проходьте теоричну частину  та одразу закріплюйте знання через практичному завданні.',
        amount: 0,
    },
    {
        src: '/src/img/Content/AboutService.png',
        title: 'Уроки з історіями',
        description: 'Для тих, хто любить читати, підготовлені спеціальні уроки з історіями. Після кожної історії на вас чекають завдання, які не лише перевірять ваше розуміння прочитаного, але й допоможуть розширити словниковий запас та покращити граматичні навички. Ви зможете аналізувати тексти, виконувати завдання на інтерпретацію та критичне мислення. ',
        amount: 0,
    },
    {
        src: '/src/img/Content/AboutService.png',
        title: 'Граматичні уроки ',
        description: 'Граматика – це основа будь-якої мови, наші граматичні уроки допоможуть вам розібратися в ній незалежно від того, яку мову ви вивчаєте. Ви дізнаєтесь про правила побудови речень, використання часів та інших граматичних конструкцій. Кожен урок містить як теорію, так і практичні завдання, щоб ви могли одразу застосовувати нові знання. Граматика може бути різною в різних мовах, але наші уроки допоможуть вам систематично опанувати її.',
        amount: 0,
    },
]