export const reviews = [
    {
        title: 'Чудова платформа для вивчення мов!',
        text: 'Мені дуже подобається, як організовані курси. Інтерактивні уроки дійсно допомагають закріпити знання. Рекомендую всім!',
        user: 'Олександр',
        date: '25 жовтня',
        grade: '5'
    },
    {
        title: 'Досить цікаво та корисно',
        text: 'Курси є дуже інформативними, але іноді хочеться більше практичних завдань. Загалом, я задоволений!',
        user: 'Pretty Girl',
        date: '10 квітня',
        grade: '4'
    },
    {
        title: 'Моїм дітям дуже подобається!',
        text: 'Мої діти навчаються на цій платформі вже кілька місяців, і вони завжди з нетерпінням чекають нових уроків. Дуже дякую!',
        user: 'Aqua',
        date: '12 червня',
        grade: '4'
    },
    {
        title: 'Хороший сервіс, але є нюанси',
        text: 'Платформа зручна, але іноді виникають проблеми з доступом до матеріалів. Сподіваюся, що це виправлять.',
        user: 'Svitlana Nerubaiko',
        date: '1 квітня',
        grade: '3'
    }
]