import styles from './wayToTeach.module.less'
import { useTheme } from '../../../Hooks/ThemeContext'

export default function WayToTeach() {
    const { theme } = useTheme()
    return (
        <div className={`${"block__container"} ${styles.wayToTeach}`}>
            <h2 className={styles.wayToTeach__title}>Наш підхід до навчання</h2>
            <ol className={`${styles.wayToTeach__list} ${theme === 'dark' ? styles.darkList : styles.lightList}`}>
                <li><b>Індивідуалізація:</b> кожен учень може обирати з понад 10 різних мов, включаючи англійську, польську та чеську, проходячи більше ніж 1000 уроків, які адаптовані для різних рівнів підготовки.</li>
                <li><b>Моніторинг прогресу:</b> відслідковує весь ваш шлях, в системі профілю, покращуйте ваш рівень та отримайте спеціальну валюту для відкриття нової кастомізації вашого аватару та профілю.</li>
                <li><b>Гнучкість у навчанні:</b> в нашому проекті присутня система рейтингу для кожного курсу, проходьте завдання та отримайте рейтингові бали, змагаючись з друзями в списку лідерів.</li>
                <li><b>Різноманітність методів:</b> ми пропонуємо чотири різні підходи до навчання — від інтерактивних вправ до поглибленого вивчення граматики та практики з носіями мови, щоб кожен міг знайти свій ідеальний стиль навчання.</li>
                <li><b>Реальне спілкування:</b>заводьте друзів та спілкуйтеся з ними покращуючи ваші навички, а якщо спілкування з людьми для вас проблема вам допоможе наш ШІ тренежар.</li>
                <li><b>Систематичне збагачення словникового запасу:</b> кожен користувач отримує свій словник, в який з проходженням нових уроків та граматичних завдань, будуть додаватися слова, та стійкі вирази.</li>
            </ol>
        </div>
    )
}